[{"schedule":{"schedule_id":"527ef7dd8eae44384a000007","title":"DevCon Welcome Speech","description":"Welcome speech","session_time":"2013-11-23T08:35:00Z","talktype_ids":["527ef8058eae44b948000008"],"location":"527ef49d8eae446917000001","talktype":"527ef8058eae44b948000008","speaker_ids":["527ef79c8eae4457ae000006"],"speaker_names":["Ye Yint Win"],"talktype_name":["General"]}},{"schedule":{"schedule_id":"527efc298eae4480e2000009","title":"Opening Speech","description":"Opening speech by Minister of Information","session_time":"2013-11-23T08:45:00Z","talktype_ids":["527ef8058eae44b948000008"],"location":"527ef49d8eae446917000001","talktype":"527ef8058eae44b948000008","speaker_ids":["527f20da3ff50bae46000007"],"speaker_names":["U Thaung Tin"],"talktype_name":["General"]}},{"schedule":{"schedule_id":"527f21cf3ff50b169d000009","title":"Software Industry Updates and About SIDC","description":"Software Industry Updates and About SIDC","session_time":"2013-11-23T09:00:00Z","talktype_ids":["527f23373ff50b924800000e"],"location":"527ef49d8eae446917000001","talktype":"526bd124a70f49b6bd000001","speaker_ids":["527f219c3ff50b92ad000008"],"speaker_names":["U Tun Thura Thet"],"talktype_name":["Software Industry Related"]}},{"schedule":{"schedule_id":"527f22073ff50b9a1500000a","title":"Keynotes Speech","description":"Keynotes Speech by Mr. Rafiul Ahad, Vice President, Product Development at Oracle Corporation","session_time":"2013-11-23T09:15:00Z","talktype_ids":["526bd124a70f49b6bd000001"],"location":"527ef49d8eae446917000001","talktype":"527ef8058eae44b948000008","speaker_ids":["5274ee395f65f5e07d000002"],"speaker_names":["Rafiul Ahad"],"talktype_name":["Keynote"]}},{"schedule":{"schedule_id":"527f224e3ff50b1c6400000b","title":"Photo Section","description":"","session_time":"2013-11-23T09:40:00Z","talktype_ids":["527ef8058eae44b948000008"],"location":"527ef49d8eae446917000001","talktype":"527ef8058eae44b948000008","speaker_ids":["528ca56b193c2dc7da000002"],"speaker_names":["DevCon Speakers"],"talktype_name":["General"]}},{"schedule":{"schedule_id":"527f22ce3ff50b74ed00000d","title":"Developing on Microsoft Platform","description":"“This presentation will be focused on developing applications on Microsoft platform. We will cover the design and development principles of Windows 8 and Windows Phone platforms. We are also going to talk about different Microsoft programs for supporting developers.”","session_time":"2013-11-23T10:00:00Z","talktype_ids":["527f22ba3ff50b7c5f00000c"],"location":"527ef49d8eae446917000001","talktype":"527f22ba3ff50b7c5f00000c","speaker_ids":["5274eef85f65f5492e000005"],"speaker_names":["Andrey Terekhov"],"talktype_name":["Platform Related Development"]}},{"schedule":{"schedule_id":"527f23533ff50b7c1800000f","title":"Software Quality Assurance Techniques and best Practices","description":"Definition of Software Quality Assurance via Wiki:- “Software quality assurance (SQA) consists of a means of monitoring the software engineering processes and methods used to ensure quality.”  SQA process is a valuable asset to a project and the organization itself. In this presentation, SQA processes from organizations like Google, Yahoo and Microsoft will be presented as baseline processes. Differences between ISO and CMMI principles will be presented along with examples. Knowledge shearing on change control management process, software test methods, software unit code (white box testing) and test automation process will be presented. As a test engineer and test team lead, I would also be shearing all the Dos and Don’ts when it comes to software test process from test case development to test case execution itself.","session_time":"2013-11-23T10:00:00Z","talktype_ids":["527f23373ff50b924800000e"],"location":"527ef4d38eae44bf3f000002","talktype":"527f23373ff50b924800000e","speaker_ids":["526bb9f45a66dfb72400000a"],"speaker_names":["Win Myat Nwe Khine"],"talktype_name":["Software Industry Related"]}},{"schedule":{"schedule_id":"527f239d3ff50baa93000010","title":"What research projects in Myanmar  in the realm of Mobile Computing?","description":"The presentation will be started with the theme of doing research, why we need to do research, what is different between researcher and developer, what are the benefits of doing research, what requirements are needed to do research, the plan to do research, the current research situation in Myanmar and the experiences of research platform in foreign university. Then, the current active research project’s demo (from our university) in the realm of mobile computing will be highlighted and discussed. In addition, the presentation will also be included sharing research experiences of the presenter. The experiences sharing will be also included the tools, prototypes software and projects of presenter. The presentation will be concluded with the discussion of what are the necessaries to leap forward on current research trends of Myanmar.","session_time":"2013-11-23T10:00:00Z","talktype_ids":["526bd124a70f49b6bd000003"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000004","speaker_ids":["526bb9f45a66dfb72400000e"],"speaker_names":["Nandar Pwint Oo"],"talktype_name":["Mobile Development"]}},{"schedule":{"schedule_id":"527f248e3ff50b1e9f000012","title":"The invention of the dot-pattern-code “GridOnput”","description":"Dr. Kenji Yoshida is an inventor, a university professor and an entrepreneur. The invisible dot code “Grid Onput” is invented about 10 years ago and has been granted over 180 patents all over the world. The structure of Grid Onput is very unique, so that a wide range of business domain can be applied, from education to security. Today’s keynote will focus on the applications of education field. First of all, an audio/visual solution of language learning/teaching will be introduced. An audio pen G-Talk or G-Speak will link the traditional textbook with the digital content. The audience shall also find that it is applicable to Math, Chemistry and Science as well. Next, the keynote will address a Grid Electronic Whiteboard solution which may overturn the current common sense of the classroom education. The keynote will also present tools/solutions for preschool education and mobile applications.","session_time":"2013-11-23T11:00:00Z","talktype_ids":["527f2c563ff50be52800001e"],"location":"527ef49d8eae446917000001","talktype":"526bd124a70f49b6bd000004","speaker_ids":["527f245f3ff50b12a8000011"],"speaker_names":["Dr. Kenji Yoshida"],"talktype_name":["Programming Related"]}},{"schedule":{"schedule_id":"527f24c43ff50ba7fe000013","title":"Digital Right Management","description":"In the world of apps and contents, it is getting more and more important to protect what people should be allowed to use and what should be denied from digital thieves and hackers. Digital Rights Management is a term that describe all kind of protections for apps and contents. DRM will be explained with examples and theories for Android and App developers.","session_time":"2013-11-23T11:00:00Z","talktype_ids":["527f24da3ff50b8e20000014"],"location":"527ef4d38eae44bf3f000002","talktype":"527f24da3ff50b8e20000014","speaker_ids":["526bb9f45a66dfb724000012"],"speaker_names":["Htoo Myint Naung"],"talktype_name":["Digital Right Matter"]}},{"schedule":{"schedule_id":"527f26703ff50b493d000015","title":"Developing profitable cross-platform games for mobile","description":"","session_time":"2013-11-23T11:00:00Z","talktype_ids":["527f26833ff50be3e6000016"],"location":"527ef51a8eae443362000003","talktype":null,"speaker_ids":["526bb9f45a66dfb724000009"],"speaker_names":["Thet Naing Swe"],"talktype_name":["Game Industry Related"]}},{"schedule":{"schedule_id":"527f282c3ff50bbc25000017","title":"SEA Games Verification and Information System","description":"The talk will present an overview of the South East Asia Games Verification and Information System (SVIS) and the private networking system used to connect the remote SVIS terminals across 26 Games venue. Design considerations to ensure secure, reliable network operation will be discussed. Brief examples of using Python, Shell, and Linux tools for system troubleshooting and network management will be covered.","session_time":"2013-11-23T13:00:00Z","talktype_ids":["527f28393ff50b3a1c000018"],"location":"527ef49d8eae446917000001","talktype":"527f28393ff50b3a1c000018","speaker_ids":["526bb9f45a66dfb72400000c"],"speaker_names":["Dr. Allen Miu"],"talktype_name":["System Development"]}},{"schedule":{"schedule_id":"527f28a13ff50b824d000019","title":"Information Security using Digital Certificate","description":"A Digital Certificate is an electronic identification card much like driver licenses, passports and membership cards. You can present a Digital Certificate electronically to prove your identity or your right to access information or services online. Digital certificates include a public and private key pair that can be used to set up secure connections across an entrusted network and that certify online transactions, e-commerce, electronic banking and other authentications on the Internet are becoming more common. Digital signature technology is used which makes the use of the Digital Certificate, which provides an easy electronic means of verifying sender’s identity ensuring the non-repudiation. Digital Certificates can be used for a variety of electronic transactions including e-mail, e-Government, electronic commerce, groupware, electronic funds transfers, secure online communications, code signing and even network access authentication for each secure server. Authentication allows the receiver of a digital message to be confident of both the identity of the sender and the integrity of the message. The recipient (or a third party) can check the authenticity of the public key. The demonstration of how to use a digital certificate for online and email security, digital signature creation using Microsoft word and (.pdf) file and authentication using digital certificate in the web application will be included in the presentation time.","session_time":"2013-11-23T13:00:00Z","talktype_ids":["527f28ba3ff50b935f00001a"],"location":"527ef4d38eae44bf3f000002","talktype":"527f28ba3ff50b935f00001a","speaker_ids":["526bb9f45a66dfb724000005"],"speaker_names":["Nan Aye Me"],"talktype_name":["Security Related"]}},{"schedule":{"schedule_id":"527f29893ff50b73b300001b","title":"Android Design : Design for Tablets","description":"Most of the Android apps in Myanmar are targeting Phones. While Tablet market is still small, it is growing day by day. Google also urges Android Developers to design and develop for Android Tablets. This topic will discuss how to make your apps look great on tablets.","session_time":"2013-11-23T13:00:00Z","talktype_ids":["526bd124a70f49b6bd000003"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000003","speaker_ids":["526bb9f45a66dfb724000017"],"speaker_names":["Thiha Aye Kyaw"],"talktype_name":["Mobile Development"]}},{"schedule":{"schedule_id":"527f2c083ff50b7cb800001c","title":"Mobile Web and the Approach of Responsive Web Design","description":"About 30% of Internet user use Internet from mobile device and it’s expected to be 60% at 2015. If our websites and apps don’t work on mobile devices, it’s mean half of Internet user are not able to use our websites and apps. To embrace the growth of mobile device, mobile web become the serious subject that every web developer much taking care of. This topic is mainly about the techniques and approach about mobile web.  When it come to mobile web, there are two popular approach. Graceful degradation and progressive enhancement. I’m going to explain both approach in this topic but the latter one become main stream among web developers in these day. Another calling of progressive enhancement is “The mobile first approach”. I will also explain the meaning of it and why it would be better to go Tablet first than mobile first.","session_time":"2013-11-23T14:00:00Z","talktype_ids":["526bd124a70f49b6bd000002"],"location":"527ef49d8eae446917000001","talktype":"526bd124a70f49b6bd000003","speaker_ids":["526bb9f45a66dfb724000016"],"speaker_names":["Ei Maung"],"talktype_name":["Web Development"]}},{"schedule":{"schedule_id":"527f2c473ff50b35d700001d","title":"Smart controlled by Algorithm","description":"","session_time":"2013-11-23T14:00:00Z","talktype_ids":["527f2c563ff50be52800001e"],"location":"527ef4d38eae44bf3f000002","talktype":"527f2c563ff50be52800001e","speaker_ids":["526bb9f45a66dfb72400001c"],"speaker_names":["Aung Soe Moe"],"talktype_name":["Programming Related"]}},{"schedule":{"schedule_id":"527f2cb53ff50b2d1c00001f","title":"Myanmar Unicode Font Technologies past, present, and future","description":"Basic knowledge of Myanmar language and grammars. Definition and Creating for Myanmar Alphabets, Character, Symbols. (Font drawing / shaping.). Myanmar Traditional Script / Sequence Method on Unicode. Font Rendering & Unicode Data Storage. Most people do not know or confused various Myanmar Unicode fonts. Myanmar Traditional Script / Sequence Method & Unicode Data Storage. Testing result. Find out solution various Myanmar Unicode.","session_time":"2013-11-23T14:00:00Z","talktype_ids":["527f2cd13ff50b8208000020"],"location":"527ef51a8eae443362000003","talktype":"527f2cd13ff50b8208000020","speaker_ids":["527f1f803ff50b176a000005"],"speaker_names":["Aung Zaya"],"talktype_name":["Digital Language Related"]}},{"schedule":{"schedule_id":"527f2e183ff50b8b6a000023","title":"The Web.isDead()","description":"The web is now 20+ years old. This talk is a look into the history of the web, how it started, how it evolved and where it’s heading in the perspective of the developer and user. A line will be drawn between web pages, and web apps. Any web whose purpose is to display content in lieu of a brochure would be a web page. Any web that we use to check on things, or create things would be web apps. It would answer the impeding question: Is the web dead? If yes when did it die? It is intended to be both amusing and informative.","session_time":"2013-11-23T11:23:00Z","talktype_ids":["527f35303ff50b119b000034"],"location":"527ef4d38eae44bf3f000002","talktype":"526bd124a70f49b6bd000002","speaker_ids":["526bb9f45a66dfb724000007"],"speaker_names":["Ravi"],"talktype_name":["Lightning Talk"]}},{"schedule":{"schedule_id":"527f2ef63ff50bdc21000024","title":"Myanmar Weather Application","description":"The name of software that I will present is Myanmar Weather Application. It has recorded several geographic locations all over Myanmar, including 60 thousand villages and 35 thousands wards. The main purpose of that application is forecasting the weather for the next upcoming hours and days.","session_time":"2013-11-23T15:00:00Z","talktype_ids":["526bd124a70f49b6bd000003"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000003","speaker_ids":["526bb9f45a66dfb724000018"],"speaker_names":["Phyo Zaw Tun"],"talktype_name":["Mobile Development"]}},{"schedule":{"schedule_id":"527f2f3f3ff50b57bd000025","title":"Immerging trends in the Data Center [ Cloud Services (DaaS),  Multi tenancy Database, Big data/Data Warehouses ]","description":"There is a global trend to find ways to convert the data center from a cost center to profit center. To do so companies are researching and studying architecture that will afford them a flexible ,cost effective and agile data center to help lines of business compete better in their markets.  Cloud services are here to stay and one of the most popular is creating Database as a service offerings (DaaS) often called “private clouds” or even Platform as a Service) PaaS. A private cloud is where a customer builds solutions with cloud technologies behind their firewall. Multi-tenancy is a key feature of cloud solutions allowing data bases to take advantage of shared resources like, memory, I/O, and CPU.  Big Data is another emerging technology in the data center which brings both operational improvements and cost savings as well as means for creating new insight into one’s business with new ways of collecting, storing, analyzing and monetizing their data.  All topics above will be discussed during the allotted time for this lecture.","session_time":"2013-11-23T16:00:00Z","talktype_ids":["527f2f483ff50b3de9000026"],"location":"527ef49d8eae446917000001","talktype":"527f2f483ff50b3de9000026","speaker_ids":["5274eead5f65f5ecd2000004"],"speaker_names":["Brad Tewksbury"],"talktype_name":["Cloud Computing"]}},{"schedule":{"schedule_id":"527f2f9a3ff50b437b000027","title":"Open Source Development","description":"Over view of open source development. Open source products business model, market and job opportunity. Introduction to Myanmar open source community.","session_time":"2013-11-23T16:00:00Z","talktype_ids":["527f2fae3ff50befdc000029"],"location":"527ef4d38eae44bf3f000002","talktype":"527f2fae3ff50befdc000029","speaker_ids":["527f2f9f3ff50ba7fd000028"],"speaker_names":["Myo Lwin"],"talktype_name":["Open Source Related"]}},{"schedule":{"schedule_id":"527f2fff3ff50b707100002a","title":"Developing the DevCon App","description":"Our experiences about developing DevCon App (currently developing).  We also like to share the good practices, tips and suggestions that we’ve learning along the journey of developing applications for Android.","session_time":"2013-11-23T16:00:00Z","talktype_ids":["526bd124a70f49b6bd000003"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000003","speaker_ids":["526bb9f45a66dfb724000015"],"speaker_names":["Ye Lin Aung"],"talktype_name":["Mobile Development"]}},{"schedule":{"schedule_id":"527f30af3ff50b83d200002b","title":"Complex real time integration with IT and network nodes managing complete customer life cycle","description":"In today’s telecom environment, everything needs to be real time, real time and real time. With this requirement all IT applications and network integrations needs to be designed in such a manner that they offer same efficiency. The concept in telecom is that IT applications managing customer life cycle and whereas network controls his telecom usage needs. Both works hand in hand and delivers customer a world class experience, be it telecom services or customer experience in call center or any other touch points.  The role of IT applications and their development is very crucial when it comes huge data management and transaction per second (TPS). So the challenge is in design of applications to have minimum response time of query without impacting system performance.  This topic will help audience to understand the complex telecom environment and role of various IT applications in customer management.","session_time":"2013-11-24T09:00:00Z","talktype_ids":["527f34d33ff50b2b10000032"],"location":"527ef49d8eae446917000001","talktype":"527f28393ff50b3a1c000018","speaker_ids":["527f1d973ff50b8112000002"],"speaker_names":["Ambrish Dixit"],"talktype_name":["IT Business Related"]}},{"schedule":{"schedule_id":"527f30f23ff50b47d400002c","title":"Basic \"Cloud Service\" introduction for Beginner","description":"Recently all over the world Cloud service are used for many actual systems. As IT industry developers, we need to know at least basic knowledge about Cloud service.  What are advantages of Cloud service? What are features of Cloud service?  In this lightning talk, I will introduce basic knowledge what we need to know about Cloud service (for example: Scale up / CAP Theorem etc…)","session_time":"2013-11-24T09:00:00Z","talktype_ids":["527f35303ff50b119b000034"],"location":"527ef49d8eae446917000001","talktype":"527f2f483ff50b3de9000026","speaker_ids":["526bb9f45a66dfb724000019"],"speaker_names":["Koji Ishida"],"talktype_name":["Lightning Talk"]}},{"schedule":{"schedule_id":"527f314d3ff50bfe0100002d","title":"The Developer Not Just A Coder","description":"Every application development, such as desktop, web, mobile have to be code. So, just know how to write code is called a coder not a developer. The developers have both of hard skills and soft skills. And need to be known about Modern System Development Method such as Agile, Scrum etc. Moreover, they need to understanding about Human Computer Interaction (HCI) for better User Interface Design of the application. Last, every professional have code of ethics such as doctor, teacher and so on. So, the developer must be known about their code of ethics.  This topic will cover following session. Hard skills and Soft skills of developers, Basic of Modern System Development Methodologies(Agile, Scrum), Basic of Human Computer Interaction(HCI), Developer Code of ethics.","session_time":"2013-11-24T09:00:00Z","talktype_ids":["527f23373ff50b924800000e"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000004","speaker_ids":["526bb9f45a66dfb724000004"],"speaker_names":["Phone Pye Oo"],"talktype_name":["Software Industry Related"]}},{"schedule":{"schedule_id":"527f32233ff50b62cd00002e","title":"Architecture for Enterprise Software ","description":"It is time for developers in Myanmar to start embarking on developing software products and solutions that can meet the international standards and requirements for the enterprise and consumer spaces. In this presentation I will show a complete architecture blueprint for enterprise level software, the best practices for deploying software, and highlight the areas that are important for enterprises but often do not get enough focus from developers.","session_time":"2013-11-24T10:00:00Z","talktype_ids":["527f23373ff50b924800000e"],"location":"527ef49d8eae446917000001","talktype":"527f23373ff50b924800000e","speaker_ids":["5274edef5f65f5c014000001"],"speaker_names":["Viet Hung, Dinh"],"talktype_name":["Software Industry Related"]}},{"schedule":{"schedule_id":"527f32e43ff50ba8d300002f","title":"Building Cloud backend for Mobile Application","description":"Google App engine (GAE) is a highly scalable reliable cloud platform which supports several programming languages: PHP, Python, GO and Java. GAE makes developers life easier. Developers will only need to be concentrate on business requirements rather than server administration and maintenance. GAE supports both SQL and NoSQL solution for persistence. GAE also supports API creation and management for web, ios and android. In fact, it will be the main topic for the presentation.","session_time":"2013-11-24T10:00:00Z","talktype_ids":["527f2f483ff50b3de9000026"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000003","speaker_ids":["5274ee5c5f65f517f1000003"],"speaker_names":["Tin Htoo Aung"],"talktype_name":["Cloud Computing"]}},{"schedule":{"schedule_id":"527f33b63ff50bb454000030","title":"Quick Mobile API Development with Rails","description":"Today, Mobile development is in great demand and it’s sweet to have strong knowledge in making your mobile development validated, synced and data-proofed. We would like to showcase local devs on how to get started with API development, which can help their applications and web services synced, and in a connected and distributed development environment.  Why RoR ? Rails has strong conventions over configurations as it is made famous for this fact. We would like to introduce some good-to-go facts about Ruby on Rails and why Rails for Mobile API Development is AWESOME!!!  Real WorkOut! We will make a demo app presentation integrated with a simple iOS application to get into practical Rails usage and have some hands-on experiences with real world Application Development.  Sharing We have resources to share with our fellow devs and we would welcome everyone on FAQs sessions for their hungry mind.","session_time":"2013-11-24T11:00:00Z","talktype_ids":["526bd124a70f49b6bd000003"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000003","speaker_ids":["526bb9f45a66dfb724000014"],"speaker_names":["Tin Aung Lin"],"talktype_name":["Mobile Development"]}},{"schedule":{"schedule_id":"527f34ca3ff50b51cf000031","title":"Investment in technology to capitalize the third wave of technology","description":"Mobility, Cloud, Big Data and Social are forming a new wave of technology, which can fundamentally changes business and IT operation and consequently opens new opportunities for technology companies.  With the passion of being one of regional and global leaders, FPT perceives this wave as a game changer to its current business and is investing to capitalize on this opportunity.  This presentation would provide a recap on technology trend and how global market is responding. It also shares the strategy and investment of FPT Software to be ahead.","session_time":"2013-11-24T11:00:00Z","talktype_ids":["527f34d33ff50b2b10000032"],"location":"527ef49d8eae446917000001","talktype":"527f34d33ff50b2b10000032","speaker_ids":["526bb9f45a66dfb72400001b"],"speaker_names":["Le Hong Viet"],"talktype_name":["IT Business Related"]}},{"schedule":{"schedule_id":"527f3f103ff50bbed3000036","title":"Agile Web Development with Rails","description":"Ruby on Rails is a framework that makes it easier to develop, deploy, and maintain web applications. People are using it for tiniest part-time projects to big-time companies. Twitter, GitHub, Shopify, Groupon to mention a few names. In this presentation I will demonstrate rails strengths: Being easy to develop, increasing productivity, its MVC architecture and testing support.","session_time":"2013-11-24T11:00:00Z","talktype_ids":["526bd124a70f49b6bd000002"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000002","speaker_ids":["527f3ee43ff50bddae000035"],"speaker_names":["Myat Min Han"],"talktype_name":["Web Development"]}},{"schedule":{"schedule_id":"527f3f973ff50bfccc000038","title":"To Survive and Thrive (Mobility and business Intelligence)","description":"To Survive and Thrive (Mobility and business Intelligence)","session_time":"2013-11-24T13:00:00Z","talktype_ids":["527f34d33ff50b2b10000032"],"location":"527ef49d8eae446917000001","talktype":"527f34d33ff50b2b10000032","speaker_ids":["527f3f813ff50b4521000037"],"speaker_names":["Mon Mon Myint Thu"],"talktype_name":["IT Business Related"]}},{"schedule":{"schedule_id":"527f41513ff50b4d97000039","title":"Build, Operate and Maintain a private Cloud","description":"Cloud computing introduction, Why it is needed, Different cloud model, Why private cloud, Pros & Cons, How Myanmar should approach to private cloud computing, Cloud Computing future prospect","session_time":"2013-11-24T13:00:00Z","talktype_ids":["527f2f483ff50b3de9000026"],"location":"527ef49d8eae446917000001","talktype":"527f2f483ff50b3de9000026","speaker_ids":["527f1e893ff50b3c0d000004"],"speaker_names":["Zaw Win Htun"],"talktype_name":["Cloud Computing"]}},{"schedule":{"schedule_id":"527f41803ff50b312700003a","title":"MVC (Architectural Design Pattern for Awesome Developers)","description":"A software architecture pattern which separates the representation of information from the user’s interaction with it. The model consists of application data, business rules, logic, and functions. A view can be any output representation of data, such as a chart or a diagram.Multiple views of the same data are possible, such as a bar chart for management and a tabular view for accountants.","session_time":"2013-11-24T13:00:00Z","talktype_ids":["527f2c563ff50be52800001e"],"location":"527ef4d38eae44bf3f000002","talktype":"526bd124a70f49b6bd000002","speaker_ids":["526bb9f45a66dfb724000002"],"speaker_names":["Wai Lin Tun"],"talktype_name":["Programming Related"]}},{"schedule":{"schedule_id":"527f41ac3ff50b418d00003b","title":"Software Development with SCRUM","description":"Many leading software organizations such as Microsoft, Amazon, Yahoo, Linked In, etc… are moving away from traditional waterfall software development methods by adopting Agile. Among them, SCRUM is the most popular and easy to adopt software development method. As part of leap-frogging to future, Myanmar software development teams can adopt Agile and SCRUM so we can take advantage of best practices and tools used by world leading software development teams.  Talk will cover basic principle of SCRUM, roles, methodologies, tools, reports and estimation.","session_time":"2013-11-24T14:00:00Z","talktype_ids":["527f23373ff50b924800000e"],"location":"527ef49d8eae446917000001","talktype":"527f23373ff50b924800000e","speaker_ids":["526bb9f45a66dfb72400000d"],"speaker_names":["Minn Thein"],"talktype_name":["Software Industry Related"]}},{"schedule":{"schedule_id":"527f41fe3ff50b833e00003c","title":"Importance of Software Entrepreneurship for Myanmar","description":"Importance of Software Entrepreneurship for Myanmar","session_time":"2013-11-24T11:05:00Z","talktype_ids":["527f35303ff50b119b000034"],"location":"527ef49d8eae446917000001","talktype":"527f23373ff50b924800000e","speaker_ids":["526bb9f45a66dfb72400001a"],"speaker_names":["Thar Htet"],"talktype_name":["Lightning Talk"]}},{"schedule":{"schedule_id":"527f425d3ff50bcba300003d","title":"Database Replication Between  Microsoft SQL Server and MYSQL Server","description":"Database replication is the creation and maintenance of multiple copies of the same database. In most implementations of database replication, one database server maintains the master copy of the database and additional database servers maintain slave copies of the database. Database writes are sent to the master database server and are then replicated by the slave database servers. Database reads are divided among all of the database servers, which results in a large performance advantage due to load sharing. In addition, database replication can also improve availability because the slave database servers can be configured to take over the master role if the master database server becomes unavailable.  Database replication can be used on many database management systems, usually with a master/slave relationship between the original and the copies. The master logs the updates, which then ripple through to the slaves. The slave outputs a message stating that it has received the update successfully, thus allowing the sending (and potentially re-sending until successfully applied) of subsequent updates.  In real work database engine for master and slave could be different. Commonly use two database systems Microsoft SQL and MySQL when it comes to replicate it is almost like impossible without paid version of software. Microsoft SQL server as master and MySQL server as salve nearly match most of real work project. There is still challenges like Microsoft SQL database scheme have poor documentation and more complex make MySQL slave replication face difficulty.","session_time":"2013-11-24T14:00:00Z","talktype_ids":["527f426e3ff50bdd1e00003e"],"location":"527ef49d8eae446917000001","talktype":"527f426e3ff50bdd1e00003e","speaker_ids":["526bb9f45a66dfb72400000b"],"speaker_names":["Thet Aung Min Latt"],"talktype_name":["Database"]}},{"schedule":{"schedule_id":"527f429e3ff50b515500003f","title":"Large Software Development on a Shoestring","description":"I will first present the modern agile software development process and show how a world-class software development environment can be set up to develop enterprise-class applications using freely available software tools and runtime environments. I will then provide an overview of Java Platform, Enterprise Edition (Java EE). I will follow it with the demonstration of a freely-downloadable Oracle VM VirtualBox virtual machine that runs on a PC which is loaded with software development tools and runtime environments, and show how to use it to develop a simple Java EE application that runs on a Java EE server available for free.","session_time":"2013-11-24T15:00:00Z","talktype_ids":["527f23373ff50b924800000e"],"location":"527ef49d8eae446917000001","talktype":"527f23373ff50b924800000e","speaker_ids":["5274ee395f65f5e07d000002"],"speaker_names":["Rafiul Ahad"],"talktype_name":["Software Industry Related"]}},{"schedule":{"schedule_id":"527f435c3ff50bad8e000041","title":"Web Development using  interoperable - Resuable Web Service","description":"Today’s enterprise businesses spread all over the world. Traditional enterprise applications are struggling to handle real-time world-wide business processes. To overcome this difficulty, enterprise web applications are the one that helps organizations running their business online to fulfill their business requirements.  In addition, legacy stove-pipe application systems are brittle and easily broken when something makes changes to integrate with other different systems according to business agility. In this scenario, these rigid stove-pipe applications are no longer useful in today’s fast changing business environments and business practices.  Nowadays, we have seen a lot of web sites and web applications throughout the world. Various enterprises (government, private, public) use web-based application systems to fulfill their business needs, and to achieve their goals and objectives. For the business processes which traverse disparate systems need to communicate many diverse systems. In this situation, web services allow different applications from different sources to communicate with each other without time-consuming tedious coding because all communication is in technology neutral XML. Those interoperable – reusable web services are not tied to any single technology dependent software and programming language.  Web services provide the means to integrate various different systems and expose reusable business functions over HTTP as a simple transport over which data is carried. Based on my knowledge and experience, this presentation mainly focuses on the architecture and development of web application systems and integration of legacy silo systems using SOAP/WSDL based reusable, interoperable web services in SOA environment.","session_time":"2013-11-24T15:00:00Z","talktype_ids":["526bd124a70f49b6bd000002"],"location":"527ef4d38eae44bf3f000002","talktype":"526bd124a70f49b6bd000002","speaker_ids":["527f43393ff50b80c5000040"],"speaker_names":["Zaw Myint Tun"],"talktype_name":["Web Development"]}},{"schedule":{"schedule_id":"527f439d3ff50b15b3000042","title":"jQuery for Web Application","description":"jQuery is a JavaScript library designed to simplify the client-side scripting.  Recently jQuery is popular and used for design and processing of Web System. When we use jQuery we can manage and arrange Web Design and system logic easily and quickly. And also we can use many plugins with jQuery for rich client.  In this lecture we will introduce basic usage of jQuery and latest libraries with some DEMO.","session_time":"2013-11-24T15:00:00Z","talktype_ids":["526bd124a70f49b6bd000002"],"location":"527ef51a8eae443362000003","talktype":"526bd124a70f49b6bd000002","speaker_ids":["526bb9f45a66dfb724000006"],"speaker_names":["Thin Pyai Win"],"talktype_name":["Web Development"]}},{"schedule":{"schedule_id":"528784f66da49a2728000002","title":"Game Development Work Shop","description":"","session_time":"2013-11-23T13:00:00Z","talktype_ids":["527f26833ff50be3e6000016"],"location":"5287850b6da49a3e3e000003","speaker_ids":["526bb9f45a66dfb724000011"],"speaker_names":["Myint Kyaw Thu"],"talktype_name":["Game Industry Related"]}},{"schedule":{"schedule_id":"528786b36da49a9271000004","title":"Laparoscopic Surgical Training using Virtual Reality","description":"Laparoscopic surgery (keyhole surgery) is popular these days, as it is not needed to make larger incisions on the abdomen, causing high demand of well trained surgeons. Even though it is safe, intensive training is needed for junior surgeons before they operate on real patient. In past times, senior surgeons use traditional model of apprenticeship to transfer his/her expertise to junior surgeons. Due to benefits of technological advances, virtual reality technologies can be used to build the surgical training system. The components, modules and features of such system using the case study of cholecystectomy (removal of gallbladder) will be presented from software development viewpoint mainly on computer graphics and physics simulation.","session_time":"2013-11-24T11:50:00Z","talktype_ids":["527f35303ff50b119b000034"],"location":"527ef4d38eae44bf3f000002","speaker_ids":["526bb9f45a66dfb724000013"],"speaker_names":["Toe Kyaw Kyar"],"talktype_name":["Lightning Talk"]}},{"schedule":{"schedule_id":"528cc6ad6eaa2173e1000002","title":"IT for a Mobile Network Operator – connecting the pieces","description":"","session_time":"2013-11-23T15:00:00Z","talktype_ids":["527f34d33ff50b2b10000032"],"location":"527ef49d8eae446917000001","speaker_ids":["528cc4d56eaa2136bb000001"],"speaker_names":["Rui Nobrega"],"talktype_name":["IT Business Related"]}},{"schedule":{"schedule_id":"528cd7556eaa2135dc000003","title":"Forward thinking DATA API","description":"","session_time":"2013-11-23T15:00:00Z","talktype_ids":["527f2f483ff50b3de9000026"],"location":"527ef4d38eae44bf3f000002","speaker_ids":["526bb9f45a66dfb724000007"],"speaker_names":["Ravi"],"talktype_name":["Cloud Computing"]}},{"schedule":{"schedule_id":"528cddd06eaa21395b000007","title":"Going Mobile with AngularJS and Cordova","description":"Mobile is the latest trend in software development industry. Building native application takes longer time and more effort, while most of the data driven application does not required much complexity.  In this presentation, we will discuss; 1. Brief introduction of AngularJS, 2. Brief intorudctoin of Cordova framework, 3. Writing a single page application with AngularJS, 4. Packaging AngularJS application using Cordova, 5. Creating Cordova – Android application, practical example.","session_time":"2013-11-24T14:00:00Z","talktype_ids":["526bd124a70f49b6bd000003"],"location":"527ef4d38eae44bf3f000002","speaker_ids":["526bb9f45a66dfb72400001a"],"speaker_names":["Thar Htet"],"talktype_name":["Mobile Development"]}},{"schedule":{"schedule_id":"528cdf466eaa21d4ff000008","title":"Catching an Angel Investor and why you should do so","description":"","session_time":"2013-11-24T11:14:00Z","talktype_ids":["527f35303ff50b119b000034"],"location":"527ef49d8eae446917000001","speaker_ids":["526bb9f45a66dfb724000008"],"speaker_names":["Aung Aung"],"talktype_name":["Lightning Talk"]}},{"schedule":{"schedule_id":"528cdfb86eaa21d971000009","title":"Building Multi-lingual Websites with WordPress","description":"","session_time":"2013-11-24T11:32:00Z","talktype_ids":["527f35303ff50b119b000034"],"location":"527ef49d8eae446917000001","speaker_ids":["526bb9f45a66dfb724000016"],"speaker_names":["Ei Maung"],"talktype_name":["Lightning Talk"]}}]