[{"speaker":{"speaker_id":"526bb9f45a66dfb724000001","speaker_name":"Zaw Ye Myint","title":"","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/zawym.png","schedule_ids":"[]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000002","speaker_name":"Wai Lin Tun","title":"EC Member, MCPA","biography":"Degrees: M.Sc Computer Science, B.A English, Diploma in IT, Electronic & Communication , Hardware Engineering  Skillful Area: PHP, MySQL, CodeIgniter, Drupal  Attended Yangon University of Foreign Languages in 2001, and later ICT degree at Yangon University in 2002 and master of Computer Science in 2006. Worked as senior developer, team leader and project manager in various local and international IT projects. Become the executive committee member of MCPA (Yangon) in 2013.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/wailt1.png","schedule_ids":"[\"527f41803ff50b312700003a\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000004","speaker_name":"Phone Pye Oo","title":"Technical Director, RoNetz Web Solution","biography":"Founder and Technical Director at RoNetz Web Solution. Over 7 years experiences in Web Development Field. First Prize Winner of the 5th Myanmar ICT week Web Design Competition. Passion in Web Design, Application Development, Modern System Development Methodologies, Project Management and Contribute Knowledge.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/ppo.png","schedule_ids":"[\"527f314d3ff50bfe0100002d\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000005","speaker_name":"Nan Aye Me","title":"QA Test Engineer, MICTDC","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/nan.png","schedule_ids":"[\"527f28a13ff50b824d000019\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000006","speaker_name":"Thin Pyai Win","title":"Developer, Big Data Analysis","biography":"Working as a developer for Big Data analysis system development at Acroquest Myanmar Technology Co., Ltd.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/thinpw.png","schedule_ids":"[\"527f439d3ff50b15b3000042\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000007","speaker_name":"Ravi","title":"COO, GMIT","biography":"Physics grad. FUEL & UTRSS for Myanmar, best practices for IT Managers. Focusing on data, virtualization and the web. Love STEM & SciFi.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/ravi1.png","schedule_ids":"[\"527f2e183ff50b8b6a000023 , 528cd7556eaa2135dc000003\", \"527f2e183ff50b8b6a000023\", \"528cd7556eaa2135dc000003\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000008","speaker_name":"Aung Aung","title":"","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/aung-aung.png","schedule_ids":"[\"528cdf466eaa21d4ff000008\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000009","speaker_name":"Thet Naing Swe","title":"Unity3D Specialist","biography":"I have been working in the software and game industry for more than 6 years and have passion for creating all types of games including serious, casual and AAA games. I received the 1st class Honor Degree in Computer Games Development from University of Central Lancashire, UK in 2008 and started working as a game programmer at CodeMonkey studio for a year. Before joining to my current position at NTU, I’ve been working on my own game projects while learning new game engine technologies such as UDK, Unity3D and got a lot of experience with these engines.\n\nI also have experience in MMO game development with server-side programming using Photon Socket Server. I am specilised in using Unity3D with Photon server to make Massively Multiplayer Games. I got scripting and level design knowlege of CryEngine2 as we’ve developed an MMO world for Bluemars which is a 3D social networking MMO environment (like SecondLife) which uses CryEngine to provide realistics environments.\n\nI had worked on the various game titles using different frameworks and commercial engines including but not limited to Unity3D, UDK, XNA framework and some in-house game engines for different platforms including PC, Mac, Xbox, Nintendo DS and iOS. I am now expanding my knowledge on developing games for other platforms such as Android, Windows Phone 7 and Bada.\n\nCurrently, I am doing my own Singapore based Start-Ups company where I mainly involve in creating contents not limited to Games, Mobile Applications development, SDKs creation for our own inhouse cloud based backend solutions.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/thetns.png","schedule_ids":"[\"527f26703ff50b493d000015\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400000a","speaker_name":"Win Myat Nwe Khine","title":"Software Test Team Lead","biography":"I am a very curious person and I enjoy being a software test engineer. Being a software test engineer give me a freedom to expand my curiosity on each software system that I have validated. Having a strong discipline on software testing processes can help an organization not only to increasing quality of the product but also on reducing rework which is a high cost factor in the industry.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/winmnk.png","schedule_ids":"[\"527f23533ff50b7c1800000f\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400000b","speaker_name":"Thet Aung Min Latt","title":"CEO, Diamond Consultant Group","biography":"12+ years in IT sector – Administrator, network engineer, webmaster, manager. 8+ years IT related teaching experience; including curriculum development. 6+ years in senior management role with budget and taxation forecasting, planning, and human resource management. 6+ years experience Human resource management skills such as interviewing, examine and screening candidate.Demonstrable professionalism and leadership abilities; Excellent knowledge of international organizations; Experience mentoring staff teams of 125+ people.Computer system planning and integration. Web development with e-commerce strategy and development. Strategic planning with IT for business development/ Community development. Strong research and development of new technology. Experience effectively integrating IT and community development. Knowledge of TCP/IP stacks and their functionality. Staff development and skill mentoring.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/thetaung.png","schedule_ids":"[\"527f425d3ff50bcba300003d\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400000c","speaker_name":"Dr. Allen Miu","title":"CTO, Frontiir Co Ltd","biography":"Dr. Allen Miu is a Co-Founder and Chief Technology Officer of Frontiir Co Ltd. Before founding Frontiir, Allen served seven years as the chief architect and lead developer of Ruckus SmartMesh, a WiFi-based self-healing multi-hop wireless networking system. SmartMesh has been deployed worldwide, including Tikona, the largest mesh deployment in the world with over 40,000 nodes operating in 26 cities across India. Allen is excited to be in Yangon to help fulfill the company’s mission of delivering affordable and innovative digital solutions to local schools, businesses and the residents of Myanmar. Dr. Allen Miu holds a B.Sc. in EECS with Highest Honors from University of California at Berkeley, and S.M. and PhD degrees in CS from Massachusetts Institute of Technology. He has published over 10 conference papers and articles and author of five US patents. His area of interest includes Wireless Networks, Embedded Devices and Linux Programming.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/drallen.png","schedule_ids":"[\"527f282c3ff50bbc25000017\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400000d","speaker_name":"Minn Thein","title":"VP of Engineering, Frontiir","biography":"Minn Thein is a co-founder of Frontiir and serves as VP of Engineering. Minn brings 14 years of consulting, building and leading globally distributed IT engineering teams delivering highly complex enterprise business solutions to multi-national corporations and governments. Prior to joining Frontiir, Minn was a Senior Director at Avanade where Minn had built and led high-performing product engineering teams in the area of Enterprise Resource Planning (ERP) and Customer Relationship Management (CRM) products for Avanade Software and Cloud Services (SCS) organization. Prior to SCS, Minn worked as a senior developer and architect for Avanade Connected Architecture (ACA.NET) where he designed and built enterprise software development platform. Minn holds BSEE from University of Illinois at Urbana-Champaign and a technology patent in the area of SOA architecture.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/min-thein.png","schedule_ids":"[\"527f41ac3ff50b418d00003b\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400000e","speaker_name":"Nandar Pwint Oo","title":"Researchers, UCSY","biography":"She is one of the researchers from University of Computer Studies, Yangon and have got over 6 years of experiences in teaching and software development in mobile platform. She got the Ph.D from the University of Computer Studies, Yangon. She received B.C.Sc degree in 2004, B.C.Sc (Hons:) Degree in 2005 and M.C.Sc degree in 2008. Her research interested areas are Human Computer Interaction (HCI), Mobile Computing and Cloud Computing. She has been involved in developing Android application and sharing knowledge with the online community. She has been participated in 1st Developer Conference Yangon, Barcamp Yangon and International Conferences.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/nandarpo.png","schedule_ids":"[\"527f239d3ff50baa93000010\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000010","speaker_name":"Su Hlaing Htwe","title":"QA Test Engineer, MICTDC","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/suht.png","schedule_ids":"[]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000011","speaker_name":"Myint Kyaw Thu","title":"Director, Total Gameplay Studio","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/myintkt.png","schedule_ids":"[\"528784f66da49a2728000002\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000012","speaker_name":"Htoo Myint Naung","title":"CEO, Technomation","biography":"Born in Yangon on 1987, Htoo Myint Naung was graduated from University of Computer Studies, Yangon, won multiple National ICT Awards and a Asia Pacific ICT Award. Founded a company called Technomation in 2004 and have been CEO and President of it. His lifetime innovations include MySM for Myanmar SMS, initiation of Mobile Apps Industry and PolarStar Navigation GPS, and so on.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/hmn.png","schedule_ids":"[\"527f24c43ff50ba7fe000013\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000013","speaker_name":"Toe Kyaw Kyar","title":"Research Engineer at Institute for Infocomm Research","biography":"I am now working as a Research Engineer at Institute for Infocomm Research, A*STAR, Singapore. I had graduated MSc (Digital Media Technology) from School of Computer Engineering, NTU, S'pore in 2010, BEngg (Information Technology) and BTech (InformationTechnology) from Technological University (Hmawbi) in the year 2008 and 2007 respectively. I have experienced in IT infrastructure, computer sicence, virtual reality and microcontrollers. My interests are C & C++ Programming, 3D Computer Graphics, Physics Simulation and Digital Media Technologies.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/toekk.png","schedule_ids":"[\"528786b36da49a9271000004\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000014","speaker_name":"Tin Aung Lin","title":"Web Developer at Nex Co., Ltd","biography":"Tin Aung Lin is a web developer at Nex, who is committed to create breathtaking web designs. He is always eager to expand his horizons by learning new things. Truly in his heart, Tin despises HTML, dynamic CSS, Scripting and Server  Architecture. He has 3 years experience in LAMP stack web development. At the present, Tin is learning Ruby on Rails programming language, which he takes as a new interest and tends to fully utilize in the near future. Before venturing into the field of programming, Tin was a student at Mandalay Technological University, pursuing his Bachelor in Civil Engineering. Later, he bravely quitted his educational path and jumped in with both feet into programming. Tin currently has a developer internship position at Nex. Every day, he puts tremendous effort into creating things that everyone will fall in love with.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/tinal.png","schedule_ids":"[\"527f33b63ff50bb454000030\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000015","speaker_name":"Ye Lin Aung","title":"Programmer at Zwenexsys Co., Ltd","biography":"A passionate student / below-average programmer. Highly motivated and result-oriented. Software Architect-wannabe.\n\nInterests in Audiology, Computer Networking, Computer Programming, Photography, Origami, Reading Books, Learning new stuff, Mentorship, Entrepreneurship, Public Speaking, Open Source, Linux.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/yela.png","schedule_ids":"[\"527f2fff3ff50b707100002a\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000016","speaker_name":"Ei Maung","title":"CEO, Fairway Web","biography":"Professional web developer since 2006. Founder at Fairway Web and currently providing web development and consultant services for many happy clients across the world. Also coaching and training newcomers with a web development course and already produced hundreds of professional web developers.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/eimg.png","schedule_ids":"[\"527f2c083ff50b7cb800001c\", \"528cdfb86eaa21d971000009\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000017","speaker_name":"Thiha Aye Kyaw","title":"Android Developer","biography":"Graduated IDCS from MCC and I’ve developed Frozen Keyboard for Android since 2011. I’ve been doing Android projects for more than 2 years and I’m only interested in Android.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/thihaak.png","schedule_ids":"[\"527f29893ff50b73b300001b\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000018","speaker_name":"Phyo Zaw Tun","title":"Web Developer","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/pzt.png","schedule_ids":"[\"527f2ef63ff50bdc21000024\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb724000019","speaker_name":"Koji Ishida","title":"Software Developer, Acroquest Technology Co., Ltd","biography":"Developed cloud-based, CMMI-compliant software configuration management system.After the massive Earthquake in Japan 3.11 2011, responding to the strong demands from Japanese largest telecommunication company, worked as the development team leader for Japanese nation-wide telecommunication infrastructures monitoring systems used for rapid restoration from massive disasters (Earthquake, Tsunami etc).Interests in Social development using cutting-edge software technologies, Big Data analysis OSS (Cassandra, Storm, Hadoop ), Web OSS Framework (Spring, Struts ), Systematic and efficient software development processMain language : Java","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/koji1-150x150.png","schedule_ids":"[\"[\\\"527f30f23ff50b47d400002c\\\"]\", \"527f30f23ff50b47d400002c\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400001a","speaker_name":"Thar Htet","title":"CEO, Zwenexsys","biography":"Fun loving active self learner, experienced in Web GIS, web development, data crunching, server setup, deployment, management, mobile application development, cloud services and training and coaching young startups and entrepreneurs.  Love innovations, always keep looking for better ways to increase productivity, and like solving difficult problems in any business domains. Believe in life long learning and love coaching youths to be street-smart and become entrepreneurs.  A regular speaker at Developer Conference, Yangon and Barcamp Yangon since 2010, conducting presentations about Entrepreneurship, Business Model Canvas, Programming and technology topics.  Organized first Myanmar Android Bootcamp to promote and kick-start android programming for Myanmar developers.  Organized meetups of startup founders in Yangon for campfire discussion among the entrepreneur to share, network and help solve each other problems.  Specialities: Web, GIS, .Net, ROR, Python, Ruby, GO, Java, AWS, Cloud application, Distributed application, Android, BlackBerry, Productive practices and CEFE Training.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/tharhetet.png","schedule_ids":"[\"[\\\"527f41fe3ff50b833e00003c\\\"]\", \"527f41fe3ff50b833e00003c\", \"528cddd06eaa21395b000007\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400001b","speaker_name":"Le Hong Viet","title":"Technology Director,FPT Software","biography":"He is currently appointed as Chief Technology Officer of FPT Software, responsible for defining technology strategy for the organization, incubating new technology services, managing R&D activities and advanced technical capability enablement.His current interest topics are: Enterprise Architecture, Cloud Computing, Enterprise Mobility, Big Data and Analytics, M2M.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/lehv.png","schedule_ids":"[\"527f34ca3ff50b51cf000031\"]"}},{"speaker":{"speaker_id":"526bb9f45a66dfb72400001c","speaker_name":"Aung Soe Moe","title":"","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/aungsm.png","schedule_ids":"[\"527f2c473ff50b35d700001d\"]"}},{"speaker":{"speaker_id":"5274edef5f65f5c014000001","speaker_name":"Viet Hung, Dinh","title":"Enterprise Architect, Oracle","biography":"Enterprise Architect at Oracle Corporation (ASEAN) and leads the enterprise architecture engagements in emerging markets for Cambodia, Myanmar, Laos, and Singapore.  He has over 17 years of experience in IT industry and has held a variety of roles in the areas relating to consulting services, software product development, project management, systems integration, solution architecture, enterprise architecture, and leading large IT System implementation and IT transformation projects for clients in government and private sectors. With over 10 years in software product development, Viet Hung has gained extensive knowledge and experience in development processes and software development technology. He is Scrum Master with strong believe in agile development methodology and he himself has been practicing Scrum for over 6 years.  As an Enterprise Architect at Oracle corporation, Viet Hung works across all lines of business within Oracle to provide unified solutions that best suit customer’s business strategy.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/VietHungDinh.png","schedule_ids":"[\"527f32233ff50b62cd00002e\"]"}},{"speaker":{"speaker_id":"5274ee395f65f5e07d000002","speaker_name":"Rafiul Ahad","title":"Vice President, Product Development at Oracle Corporation","biography":"Rafiul Ahad has been in the commercial software development area for more than 20 years. He has served in various positions as software developer, software architect, software development manager, and software development executive initially at Hewlett-Packard and now at Oracle Corporation. He has managed and technically led several commercial software product development projects from scratch including OpenODB and Odapter object-oriented database products at HP, and Oracle Lite mobile database and Oracle Beehive collaboration products at Oracle. He has published several conference and journal papers in Computer Science and has received several U.S. and international patents in information technology. He received his B.Sc. degree in Physics from Rangoon Arts and Science University; M.Sc. in Computer Science from Universities Computer Center, Rangoon; M.Sc. in Computer Applications from the Asian Institute of Technology, Bangkok; and Ph.D. in Computer Science from the University of Southern California, Los Angeles. He was Assistant Professor of Information Systems at the University of Maryland, College Park for four years before joining the software industry.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/Rafiul-Ahead.png","schedule_ids":"[\"527f429e3ff50b515500003f\", \"527f22073ff50b9a1500000a\"]"}},{"speaker":{"speaker_id":"5274ee5c5f65f517f1000003","speaker_name":"Tin Htoo Aung","title":"Founder, Myanmar Hub","biography":"I am a 3rd year computer science student at University of Otago, New Zealand. I am also a mobile developer and create app with the name “Myanmar Hub (http://www.myanmarhub.net)” in my spare time. Here is my linkedin profile: http://nz.linkedin.com/pub/tin-htoo-aung/72/500/526/","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/tinha.png","schedule_ids":"[\"[\\\"[]\\\", \\\"527f32e43ff50ba8d300002f\\\"]\", \"527f32e43ff50ba8d300002f\"]"}},{"speaker":{"speaker_id":"5274eead5f65f5ecd2000004","speaker_name":"Brad Tewksbury","title":"Sr. Director Business Development, Oracle","biography":"During my career at Oracle I have acquired the following skills, engaged with following teams in the following geographies in the following verticals.  Skills: Sales, Corporate and Business Development, Product Management, Strategy, Alliances, Operations, and Government related activities.  Experience Working with Extended Teams: Sales, Sales Consultants, Marketing, PR, Product Development, Product Management, Center of Excellence Labs, Alliances and Channels, and M&A.   Geographies with Work Experience: North America, Asia Pacific, Europe, Middle East & Africa and Latin America  Experience with Customers in Following Verticals: Telecom, Retail, Gov’t, FSI, Utilities, Manufacturing, Healthcare and Education.  Specialties:Sales, Corporate and Business Development, Strategy, Government Relations, North America, Asia Pacific, Global Team Management, and Organizational Development. Solutions involving Mobile & Wireless computing, Voice applications, Sensor-Based services such as RFID; Embedded database solutions and Data Warehousing/Business Intelligence.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/BradTewksbury.png","schedule_ids":"[\"527f2f3f3ff50b57bd000025\"]"}},{"speaker":{"speaker_id":"5274eef85f65f5492e000005","speaker_name":"Andrey Terekhov","title":"Technical Evangelism Lead, Microsoft","biography":"Technical Evangelism Lead at Microsoft Asia & Pacific Headquarters. In this position he is responsible for promoting Microsoft platform to Developers and Software Companies in the region, with a special focus on Windows 8 and Windows Phone. Andrey is a 10-year veteran of Microsoft and has great international experience from his previous assignments in Russia, Ukraine and Germany. Prior to Microsoft, Andrey worked in a Russian software outsourcing company. Andrey holds a Ph.D. in Computer Science from St. Petersburg State University (Russia).","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/AndreyT.png","schedule_ids":"[\"527f22ce3ff50b74ed00000d\"]"}},{"speaker":{"speaker_id":"527ef79c8eae4457ae000006","speaker_name":"Ye Yint Win","title":"","biography":"","speaker_photo":"","schedule_ids":"[\"[]\", \"527ef7dd8eae44384a000007\"]"}},{"speaker":{"speaker_id":"527f1d4d3ff50b197c000001","speaker_name":"Hein Win Toe","title":"Android specialist at Nex Technology","biography":"In 2013, Hein graduated from the University of Greenwich and received a Bachelor of Science. Yet, his works with Android Platform started way before his graduation. Hein has over 3 years experience in Android Development and over 1 year experience in Server Side Development (primarily in PHP-MySQL combo). Hein is currently pursuing another Bachelor degree at Dagon University of Distance Education. He usually conduct experiments on his Raspberry Pi during his free time. Hein is the type of person who is never shy but always proud to be a nerd.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/heinwt.png","schedule_ids":"[\"[]\"]"}},{"speaker":{"speaker_id":"527f1d973ff50b8112000002","speaker_name":"Ambrish Dixit","title":"AVP & Head of Sales Automation at Telenor","biography":"He has extensive and rich experience of more than 15 years in various telecom companies in India and abroad. He has worked with flagship companies like Bharti airtel (Singtel venture in India), Uninor (Telenor operations in India) in the area of business automation and complete customer life cycle management. He has lead rollout and successful implementation of various automation projects in telecom and retail operations companies. One of the most successful projects of Sales and Distribution automation in Uninor is now being implemented in all Asian Telenor operations. He holds Degree in Engineering from University of Kanpur (India) and Post graduate Diploma in Management from Indian Institute of Management, Indore, India.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/Ambrish-Dixit.png","schedule_ids":"[\"527f30af3ff50b83d200002b\"]"}},{"speaker":{"speaker_id":"527f1e893ff50b3c0d000004","speaker_name":"Zaw Win Htun","title":"General Manager, DIR-ACE Technology","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/zawwt.png","schedule_ids":"[\"527f41513ff50b4d97000039\"]"}},{"speaker":{"speaker_id":"527f1f803ff50b176a000005","speaker_name":"Aung Zaya","title":"Fonts Creator at Myanmars.net","biography":"WIN Myanmar Fonts Create and Development – (Since 1992), MAC Myanmar Sar Systems – MAC Fonts – (Since 1996), MinGaLarPar Myanmar Sar Systems – Phonetic Keyboard – (Since 1996), MinGaLarPar Standard Myanmar Sar Systems – (Unicode)","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/aungzy.png","schedule_ids":"[\"527f2cb53ff50b2d1c00001f\"]"}},{"speaker":{"speaker_id":"527f1faf3ff50b9a7f000006","speaker_name":"Zayar","title":"iOs Ninja","biography":"Zayar is a lead iOS developer of Nex. Due to his burning passion, Zay has been assigned for all iOS development projects. In 2008, Zay received his Bachelor of Computer Science Degree from University of Computer Studies, Yangon. He has also earned a Bachelor of Science from University of Greenwich in 2013. Zay spent 3 years working in various iOS development projects, where he obtained his invaluable experience in Magazine Publication Projects, Multi Client Entertainment System Development and Directory Application Development for banking systems. He has also designed many social network applications for dedicated clients. Before joining Nex, he acted as a major key role player in one of the most accomplished pioneer mobile company in Myanmar.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/zayar.png","schedule_ids":"[\"[\\\"[]\\\"]\"]"}},{"speaker":{"speaker_id":"527f20da3ff50bae46000007","speaker_name":"U Thaung Tin","title":"","biography":"","speaker_photo":"","schedule_ids":"[\"[]\", \"527efc298eae4480e2000009\"]"}},{"speaker":{"speaker_id":"527f219c3ff50b92ad000008","speaker_name":"U Tun Thura Thet","title":"Founder and Chairman at MIT","biography":"","speaker_photo":"","schedule_ids":"[\"527f21cf3ff50b169d000009\"]"}},{"speaker":{"speaker_id":"527f245f3ff50b12a8000011","speaker_name":"Dr. Kenji Yoshida","title":"President, Gridmark Inc.","biography":"In 1991 Dr. Yoshida established Institute of Visual Science Co., Ltd. in order to spread CG/VR technologies. Since then, he has established a number of IT companies including Digital Hollywood Co., Ltd. and made efforts to expand the information technologies. In 2000, he took up a professorship at Housei University and promoted practical education using digital contents.  In 2004, he established Gridmark Inc. to commercialize his invention; invisible code “Grid Onput”.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/kenji-yoshida-dr.png","schedule_ids":"[\"527f248e3ff50b1e9f000012\"]"}},{"speaker":{"speaker_id":"527f2d483ff50b7c9f000022","speaker_name":"Quach Lieu Hoan","title":"","biography":"","speaker_photo":"","schedule_ids":"[\"[]\"]"}},{"speaker":{"speaker_id":"527f2f9f3ff50ba7fd000028","speaker_name":"Myo Lwin","title":"Senior Staff Technical Engineer, FireEye","biography":"Knowledge is to help others and make the world better.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/myo-lwin.png","schedule_ids":"[\"527f2f9a3ff50b437b000027\"]"}},{"speaker":{"speaker_id":"527f3ee43ff50bddae000035","speaker_name":"Myat Min Han","title":"CTO, Rebbiz","biography":"As a self-proclaimed geek and an alledged entrepreneur, he majorly spends his hours with Ruby on Rails, PHP, Javascript and a terminal while on the look out to ditch old techs and adopt new ones. These days MyanmarCarsDB.com, MyanmarJobsDB.com and MyanmarHouseDB.com are the triplets that keeps him awake at night.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/myatmh.png","schedule_ids":"[\"527f3f103ff50bbed3000036\"]"}},{"speaker":{"speaker_id":"527f3f813ff50b4521000037","speaker_name":"Mon Mon Myint Thu","title":"Managing Director at AcePlus Solutions","biography":"","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/monmmt.png","schedule_ids":"[\"527f3f973ff50bfccc000038\"]"}},{"speaker":{"speaker_id":"527f43393ff50b80c5000040","speaker_name":"Zaw Myint Tun","title":"CTO, Information Matrix","biography":"E-Government experience and Enterprise Integration experience in Australia: Worked as a Data Modeler/Analyst/Architect at Department of Immigration and Citizenship in Canberra and in Telecommunication (Telco) in Sydney.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/zawmt.png","schedule_ids":"[\"527f435c3ff50bad8e000041\"]"}},{"speaker":{"speaker_id":"528ca2dc193c2d579a000001","speaker_name":"Opening Video","title":"Channel 5 News","biography":"Opening Video","speaker_photo":"","schedule_ids":"[\"[]\"]"}},{"speaker":{"speaker_id":"528ca56b193c2dc7da000002","speaker_name":"DevCon Speakers","title":"DevCon Speakers","biography":"DevCon Speakers","speaker_photo":"","schedule_ids":"[\"[]\", \"527f224e3ff50b1c6400000b\"]"}},{"speaker":{"speaker_id":"528cc4d56eaa2136bb000001","speaker_name":"Rui Nobrega","title":"IT Director, Ooredoo Myanmar","biography":"He worked in Portugal (12 years), Brazil (1 year), Spain (1 year), Dubai, Romania, and lastly in Movicel, Angola (3 years) where he held various positions such as Head of Network Operations and Chief Information Officer.  He graduated at Instituto Superior Tecnico, Technical University Lisbon with a major in Computer Science and Software Engineering.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/rui-nobrega.jpg","schedule_ids":"[\"528cc6ad6eaa2173e1000002\"]"}},{"speaker":{"speaker_id":"528cdaed6eaa21e1ac000005","speaker_name":"Khine Wai Oo","title":"Developer, Acroquest Myanmar Technology","biography":"Education: M.C.Sc  Area of interest: Networking, Java, C#, PHP","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/khinewo.png","schedule_ids":"[\"[]\"]"}},{"speaker":{"speaker_id":"528cdb6c6eaa218d3c000006","speaker_name":"Setsuo Fuke","title":"Technical Expert, Gridmark Inc.","biography":"Setsuo Fuke is an engineer who has a lot of experience in supporting customers technically around the world. Today he will support Dr. Kenji Yoshida to present his technology. The structure of Grid Onput is unique and very interesting. It can be applied to a wide range of business domain including education, security and so on. He hopes to express how the technology can bridge the traditional printed contents to the digital contents.","speaker_photo":"http://devconmyanmar.org/2013/wp-content/uploads/2013/10/fuke.png","schedule_ids":"[]"}}]